src/СРМ/src/Documents/ПланОбучения/ПланОбучения.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ПланОбучения</name>
  <registerRecords>AccumulationRegister.Обучение</registerRecords>
  <attributes>
    <name>Пользователь</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Курс</name>
    <type>
      <types>CatalogRef.Курсы</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаНачала</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОкончания</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Завершен</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Оценка</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>1</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Замечания</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Преподаватель</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Проект</name>
    <type>
      <types>CatalogRef.Проекты</types>
    </type>
  </attributes>
  <tabularSections>
    <name>План</name>
    <attributes>
      <name>Дата</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>УдалитьТема</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Длительность</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>УдалитьВыполнено</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>УдалитьДатаВыполнения</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Урок</name>
      <type>
        <types>CatalogRef.Уроки</types>
      </type>
    </attributes>
    <attributes>
      <name>Задача</name>
      <type>
        <types>DocumentRef.Задача</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

src/СРМ/src/Documents/ПланОбучения/ManagerModule.bsl
// СтандартныеПодсистемы.ВерсионированиеОбъектов

// Определяет настройки объекта для подсистемы ВерсионированиеОбъектов.
//
// Параметры:
//  Настройки - Структура - настройки подсистемы.
Процедура ПриОпределенииНастроекВерсионированияОбъектов(Настройки) Экспорт
КонецПроцедуры

// Конец СтандартныеПодсистемы.ВерсионированиеОбъектов


Процедура Печать(ТабДок, Ссылка) Экспорт

	Макет = Документы.ПланОбучения.ПолучитьМакет("ПланОбучения");
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ПланОбучения.Дата КАК Дата,
	|	ПланОбучения.ДатаНачала КАК ДатаНачала,
	|	ПланОбучения.ДатаОкончания КАК ДатаОкончания,
	|	ПланОбучения.Завершен КАК Завершен,
	|	ПланОбучения.Замечания КАК Замечания,
	|	ПланОбучения.Курс КАК Курс,
	|	ПланОбучения.Номер КАК Номер,
	|	ПланОбучения.Оценка КАК Оценка,
	|	ПланОбучения.Пользователь КАК Пользователь,
	|	ПланОбучения.Преподаватель КАК Преподаватель,
	|	ПланОбучения.План.(
	|		НомерСтроки КАК НомерСтроки,
	|		Дата КАК Дата,
	|		Урок КАК Урок,
	|		Длительность КАК Длительность,
	|		Задача КАК Задача,
	|		ВЫБОР
	|			КОГДА ПланОбучения.План.Задача.ДатаВыполнения = ДАТАВРЕМЯ(1, 1, 1)
	|				ТОГДА ЛОЖЬ
	|			ИНАЧЕ ИСТИНА
	|		КОНЕЦ КАК Выполено,
	|		Задача.ДатаВыполнения КАК ДатаВыполнения
	|	) КАК План
	|ИЗ
	|	Документ.ПланОбучения КАК ПланОбучения
	|ГДЕ
	|	ПланОбучения.Ссылка В(&Ссылка)";
	Запрос.Параметры.Вставить("Ссылка", Ссылка);
	Выборка = Запрос.Выполнить().Выбрать();

	ОбластьЗаголовок = Макет.ПолучитьОбласть("Заголовок");
	Шапка = Макет.ПолучитьОбласть("Шапка");
	ОбластьПланШапка = Макет.ПолучитьОбласть("ПланШапка");
	ОбластьПлан = Макет.ПолучитьОбласть("План");
	ОбластьПланПодвал = Макет.ПолучитьОбласть("ПланПодвал");
	Подвал = Макет.ПолучитьОбласть("Подвал");

	ТабДок.Очистить();

	ВставлятьРазделительСтраниц = Ложь;
	
	Пока Выборка.Следующий() Цикл
		
		Если ВставлятьРазделительСтраниц Тогда
			ТабДок.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;

		ТабДок.Вывести(ОбластьЗаголовок);

		Шапка.Параметры.Заполнить(Выборка);
		ТабДок.Вывести(Шапка, Выборка.Уровень());

		ТабДок.Вывести(ОбластьПланШапка);
		
		ИтогоДлительность = 0;
		
		ВыборкаПлан = Выборка.План.Выбрать();
		Пока ВыборкаПлан.Следующий() Цикл
			ОбластьПлан.Параметры.Заполнить(ВыборкаПлан);
			ТабДок.Вывести(ОбластьПлан, ВыборкаПлан.Уровень());
			ИтогоДлительность = ИтогоДлительность + ВыборкаПлан.Длительность;
		КонецЦикла;

		ОбластьПланПодвал.Параметры.Длительность = ИтогоДлительность;
		ТабДок.Вывести(ОбластьПланПодвал);
		
		Подвал.Параметры.Заполнить(Выборка);
		ТабДок.Вывести(Подвал);

		ВставлятьРазделительСтраниц = Истина;
		
	КонецЦикла;

КонецПроцедуры
